sawTooth/2Dchannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
//back
    (0 0 0)
    (10 0 0)
    (10 1 0)
    (0  1 0)
    
//front points
    (0 0 0.1)
    (10 0 0.1)
    (10 1 0.1)
    (0  1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 30 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
	type	patch;
	faces
	(
	    (0 3 7 4)
        );
    }

    outlet
    {
	type	patch;
	faces
	(
	    (1 2 6 5)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(

);

// ************************************************************************* //
